## SQL at Scale with Spark SQL

Welcome to the SQL mini project. For this project, you will use the Databricks Platform and work through a series of exercises using Spark SQL. The dataset size may not be too big but the intent here is to familiarize yourself with the Spark SQL interface which scales easily to huge datasets, without you having to worry about changing your SQL queries. 

The data you need is present in the mini-project folder in the form of three CSV files. This data will be imported in Databricks to create the following tables under the __`country_club`__ database.

<br>
1. The __`bookings`__ table,
2. The __`facilities`__ table, and
3. The __`members`__ table.

You will be uploading these datasets shortly into the Databricks platform to understand how to create a database within minutes! Once the database and the tables are populated, you will be focusing on the mini-project questions.

In the mini project, you'll be asked a series of questions. You can solve them using the databricks platform, but for the final deliverable,
please download this notebook as an IPython notebook (__`File -> Export -> IPython Notebook`__) and upload it to your GitHub.

### Creating the Database

We will first create our database in which we will be creating our three tables of interest

In [3]:
%sql 
drop database if exists country_club cascade;
create database country_club;
show databases;

### Creating the Tables

In this section, we will be creating the three tables of interest and populate them with the data from the CSV files already available to you. 
To get started, first upload the three CSV files to the DBFS as depicted in the following figure

![](https://i.imgur.com/QcCruBr.png)


Once you have done this, please remember to execute the following code to build the dataframes which will be saved as tables in our database

In [24]:
import pandas as pd
file_location_bookings = "Bookings.csv"
file_location_facilities = "Facilities.csv"
file_location_members = "Members.csv"

df1 = pd.read_csv(file_location_bookings)
df2 = pd.read_csv(file_location_facilities)
df3 = pd.read_csv(file_location_members)

df = pd.DataFrame(df1)
df4 = df.merge(df2, on='facid', how='left')
# df.merge(df3, on='memid')
df4

,bookid,facid,memid,starttime,slots,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,3,1,2012-07-03 11:00:00,2,Table Tennis,0.0,5.0,320,10
1,1,4,1,2012-07-03 08:00:00,2,Massage Room 1,9.9,80.0,4000,3000
2,2,6,0,2012-07-03 18:00:00,2,Squash Court,3.5,17.5,5000,80
3,3,7,1,2012-07-03 19:00:00,2,Snooker Table,0.0,5.0,450,15
4,4,8,1,2012-07-03 10:00:00,1,Pool Table,0.0,5.0,400,15
...,...,...,...,...,...,...,...,...,...,...
4038,4038,8,29,2012-09-30 16:30:00,2,Pool Table,0.0,5.0,400,15
4039,4039,8,29,2012-09-30 18:00:00,1,Pool Table,0.0,5.0,400,15
4040,4040,8,21,2012-09-30 18:30:00,1,Pool Table,0.0,5.0,400,15
4041,4041,8,16,2012-09-30 19:00:00,1,Pool Table,0.0,5.0,400,15
4042,4042,8,29,2012-09-30 19:30:00,1,Pool Table,0.0,5.0,400,15

In [34]:
for i in df4:
    print(i)


# df4['revenue_membercost'] = [int(df4['slots'] * df4['membercost'] ) for i in df4['memid'] if i != '0' ] 
df4['revenue_guestcost'] = df4['slots'] * df4['guestcost']
# df4['revenue_total'] = df4['slots'] * df4['guestcost'] + df4['slots'] * df4['membercost']
df4

bookid
facid
memid
starttime
slots
name
membercost
guestcost
initialoutlay
monthlymaintenance
revenue_membercost

,bookid,facid,memid,starttime,slots,name,membercost,guestcost,initialoutlay,monthlymaintenance,revenue_membercost,revenue_guestcost
0,0,3,1,2012-07-03 11:00:00,2,Table Tennis,0.0,5.0,320,10,0 0.0 1 19.8 2 7.0 3 ...,10.0
1,1,4,1,2012-07-03 08:00:00,2,Massage Room 1,9.9,80.0,4000,3000,0 0.0 1 19.8 2 7.0 3 ...,160.0
2,2,6,0,2012-07-03 18:00:00,2,Squash Court,3.5,17.5,5000,80,0 0.0 1 19.8 2 7.0 3 ...,35.0
3,3,7,1,2012-07-03 19:00:00,2,Snooker Table,0.0,5.0,450,15,0 0.0 1 19.8 2 7.0 3 ...,10.0
4,4,8,1,2012-07-03 10:00:00,1,Pool Table,0.0,5.0,400,15,0 0.0 1 19.8 2 7.0 3 ...,5.0
...,...,...,...,...,...,...,...,...,...,...,...,...
4038,4038,8,29,2012-09-30 16:30:00,2,Pool Table,0.0,5.0,400,15,0 0.0 1 19.8 2 7.0 3 ...,10.0
4039,4039,8,29,2012-09-30 18:00:00,1,Pool Table,0.0,5.0,400,15,0 0.0 1 19.8 2 7.0 3 ...,5.0
4040,4040,8,21,2012-09-30 18:30:00,1,Pool Table,0.0,5.0,400,15,0 0.0 1 19.8 2 7.0 3 ...,5.0
4041,4041,8,16,2012-09-30 19:00:00,1,Pool Table,0.0,5.0,400,15,0 0.0 1 19.8 2 7.0 3 ...,5.0
4042,4042,8,29,2012-09-30 19:30:00,1,Pool Table,0.0,5.0,400,15,0 0.0 1 19.8 2 7.0 3 ...,5.0

In [5]:
# File location and type
file_location_bookings = "/FileStore/tables/Bookings.csv"
file_location_facilities = "/FileStore/tables/Facilities.csv"
file_location_members = "/FileStore/tables/Members.csv"

df1 = pd.read_csv(file_location_bookings)
df2 = pd.read_csv(file_location_facilities)
df3 = pd.read_csv(file_location_members)

file_type = "csv"

# CSV options
infer_schema = "true"
first_row_is_header = "true"
delimiter = ","

# The applied options are for CSV files. For other file types, these will be ignored.
bookings_df = (spark.read.format(file_type) 
                    .option("inferSchema", infer_schema) 
                    .option("header", first_row_is_header) 
                    .option("sep", delimiter) 
                    .load(file_location_bookings))

facilities_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_facilities))

members_df = (spark.read.format(file_type) 
                      .option("inferSchema", infer_schema) 
                      .option("header", first_row_is_header) 
                      .option("sep", delimiter) 
                      .load(file_location_members))

### Viewing the dataframe schemas

We can take a look at the schemas of our potential tables to be written to our database soon

In [7]:
print('Bookings Schema')
bookings_df.printSchema()
print('Facilities Schema')
facilities_df.printSchema()
print('Members Schema')
members_df.printSchema()

### Create permanent tables
We will be creating three permanent tables here in our __`country_club`__ database as we discussed previously with the following code

In [9]:
permanent_table_name_bookings = "country_club.Bookings"
bookings_df.write.format("parquet").saveAsTable(permanent_table_name_bookings)

permanent_table_name_facilities = "country_club.Facilities"
facilities_df.write.format("parquet").saveAsTable(permanent_table_name_facilities)

permanent_table_name_members = "country_club.Members"
members_df.write.format("parquet").saveAsTable(permanent_table_name_members)

### Refresh tables and check them

In [11]:
%sql
use country_club;
REFRESH table bookings;
REFRESH table facilities;
REFRESH table members;
show tables;

### Test a sample SQL query

__Note:__ You can use __`%sql`__ at the beginning of a cell and write SQL queries directly as seen in the following cell. Neat isn't it!

In [13]:
%sql
select * from bookings limit 3

#### Q1: Some of the facilities charge a fee to members, but some do not. Please list the names of the facilities that do.

In [15]:
%sql

####  Q2: How many facilities do not charge a fee to members?

In [17]:
%sql

#### Q3: How can you produce a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost? 
#### Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [19]:
%sql

#### Q4: How can you retrieve the details of facilities with ID 1 and 5? Write the query without using the OR operator.

In [21]:
%sql

#### Q5: How can you produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100? 
#### Return the name and monthly maintenance of the facilities in question.

In [23]:
%sql

#### Q6: You'd like to get the first and last name of the last member(s) who signed up. Do not use the LIMIT clause for your solution.

In [25]:
%sql

####  Q7: How can you produce a list of all members who have used a tennis court?
- Include in your output the name of the court, and the name of the member formatted as a single column. 
- Ensure no duplicate data
- Also order by the member name.

In [27]:
%sql

#### Q8: How can you produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30? 

- Remember that guests have different costs to members (the listed costs are per half-hour 'slot')
- The guest user's ID is always 0. 

#### Include in your output the name of the facility, the name of the member formatted as a single column, and the cost.

- Order by descending cost, and do not use any subqueries.

In [29]:
%sql

#### Q9: This time, produce the same result as in Q8, but using a subquery.

In [31]:
%sql

#### Q10: Produce a list of facilities with a total revenue less than 1000.
- The output should have facility name and total revenue, sorted by revenue. 
- Remember that there's a different cost for guests and members!

In [33]:
%sql